docs/posts/2016-07-31-should-the-church-bear-the-welfare-burden.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 21, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Should the Church Bear the Welfare Burden?</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Should the Church Bear the Welfare Burden?</h1>
<p class="subtitle" role="doc-subtitle">Jul 31, 2016</p>
</header><p>
I should have rather asked if the church <i>alone</i> should bear the burden of providing welfare. There is no doubt that the church, myself included, should bear more of the burden of caring for the poor, for that is just one of the many sacrificial things Jesus calls us to do. The church, though, cannot bear the welfare burden as it is today. Ron Sider, in <i>Just Generosity: A New Vision for Overcoming Poverty in America</i>, estimates that shouldering just the cost of Medicaid would cost each Christian congregation approximately one-half million dollars per year. Note that this includes <i>each</i> congregation, including exceptionally large churches that may well be able to afford the cost, but the median size of a Christian congregation in America is now 75 regular participants.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> So, a family of four in the median-sized congregation would have to shoulder a burden of nearly 27,000 dollars, simply to provide the services now provided by Medicaid. One can only guess at the cost of providing the full level of social services now provided by the government.
</p>

<p>
This does not mean that the church should not be developing creative ways of caring for those that Jesus and the prophets called &ldquo;the least of these.&rdquo; It does mean, though, that the church taking on more of a burden<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> does not relieve the state, nor the rest of the country, from sharing that burden. In Psalm 72, a prayer for guidance for the king, Scripture describes God&rsquo;s hope for the one who leads the state: &ldquo;May he defend the cause of the poor of the people, give deliverance to the needy, and crush the oppressor.&rdquo; To allow the state to shirk its responsibility for caring the poor means that the state will no longer fulfill its God-given role of crushing the oppressor, but instead allows the state to become the oppressor — surely not something to which a government of the people should aspire.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="http://hirr.hartsem.edu/research/fastfacts/fast_facts.html#sizecong">Hartford Institute for Religion Research</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
&ldquo;Burden&rdquo; is not the right word to use here. Caring for one another should be a joy. That we see it as a burden is a sin for which we will have to repent.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 21, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
